#+title: World Bank API Python DashBoard
#+author: Mir Behroz Noor
#+startup: show4levels

*Update: [[https://data.worldbank.org/indicator/NY.GDP.MKTP.CD][The World Bank Data]] has started showing data visualizations for years before 2000*

*+Since [[https://data.worldbank.org/indicator/NY.GDP.MKTP.CD][The World Bank Data]] has stopped visualizing data for years before 2000+. This project aims at providing the visualizations of the data available from [[https://github.com/tgherzog/wbgapi][World Bank API Python]]. There is World Bank package for R too. Either in R and Python, both support interactive Plotly. I found it easier to implement in Python. I hope someone else finds this helpful too.*

*Limitation: No option to change World Bank API Database from DashBoard/GUI*

**** Python Dependencies
In =environment.yml=, the conda environment is named =wbconda=
#+begin_src shell :exports both :results output :cache no :eval yes
  cat environment.yml
#+end_src

#+RESULTS:
#+begin_example
name: wbconda
channels:
  - conda-forge
dependencies:
  - python==3.10
  - dash==2.3.1
  - wbgapi==1.0.7
  - plotly==5.7.0
  - pandas==1.4.2
  - black
  - pip
  - pip:
    - statsmodels==0.13.2
#+end_example

